Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateCutout Property
 Can't make cut-out.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCutout { get; }
Public Shared ReadOnly Property CannotCreateCutout As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCutout {
	FailureDefinitionId^ get ();
}
static member CannotCreateCutout : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace